# 公众号配置
# 公众号appId
app_id = "wx2bcd6aaa9e1678dd"
# 公众号appSecret
app_secret = "ec4b4ed46bf36d6684eee221e1636914"
# 模板消息id
# 每日消息
template_id1 = "uLzepQ5R1-01SsYR3HUW0qeFhW5mxCtsxqRj_0h1Xrw"
# 课程消息,上课提醒
template_id2 = "loe1yHWr************************************"
# 晚安心语
template_id3 = "-fun9-2************************************"
# 接收公众号消息的微信号
# 这是openid
user = ["o2UzI2M3t7TOQZT195ENjvAin1Vg"]

# 信息配置
# 所在省份
province = "广西"
# 所在城市
city = "南宁"
# 生日，如果月份或者日期小于10，直接用对应的数字即可，例如1997-1-1，---------倒计时
birthday = "2006-8-18"
# 在一起的日子，格式同上------------计时器
love_date = "2025-08-30"
# 天行数据晚安心语 key
good_Night_Key = "aeb531ad0d42952aa70668246c020bb6"
# -------------------------------------------------------------------------
# 设置学期第一周开始日期
year = 2025
month = 9
day = 8
# 每日推送时间
post_Time = "07:35:00"
# 每节课提醒时间（有课才会提醒）, 时:分:秒  的形式, 字符串, 根据个人需要设置几次
time_table = ["07:40:00","09:20:00", "10:35:00", "11:03:00", "15:40:00", "18:40:00"]
# 课程时间
course_Time = ["8:00--8:40", "8:50--9:30", "9:45--10:25", "10:35--11:15", "11:25--12:05", "14:30--15:10", "15:20--16:00", "16:15--16:55", "17:05--17:45", "19:30--20:10", "20:20--21:00"]
# 晚安心语及第二天课程推送时间
good_Night_Time = "22:55:00"
# 课程表 "1"代表第一周，依次类推，根据个人实际课表添加，有几周就添加几周,
# 每一行代表一天, 例如  ['', '编译原理', '', '数据库原理及应用', '数据分析原理', '']  代表周一
classes = \
    {
        "1": [
            ['', '编译原理', '', '数据库原理及应用', '数据分析原理', ''],
            ['数据挖掘技术', '', '乒羽俱乐部3', '', '数据可视化', ''],
            ['计算机网络', '', '编译原理', '数据库原理及应用', '', ''],
            ['', '', '', '', '', ''],
            ['', '计算机网络', '', '数据挖掘技术', '', ''],
            ['', '', '', '', '', ''],
            ['', '', '', '', '', '']
        ],
        "2": [
            ['', '', '编译原理', '', '数据分析原理', ''],
            ['数据挖掘技术', '', '乒羽俱乐部3', '', '数据可视化', ''],
            ['计算机网络', '', '编译原理', '数据库原理及应用', '', ''],
            ['', '', '', '', '数据挖掘技术', '数据挖掘技术'],
            ['', '计算机网络', '', '数据挖掘技术6', '', ''],
            ['', '', '', '', '数据库原理及应用', ''],
            ['', '', '', '', '', '']
        ],
        "3": [
            ['', '编译原理', '', '数据库原理及应用', '数据分析原理', ''],
            ['宪法学', '宪法学', '经济法', '经济法', '经济法', '','','习概','习概','',''],
            ['劳动教育', '劳动教育', '通用学术英语', '通用学术英语', '', '物权法','物权法','行政法','行政法','',''],
            ['', '', '', '', '数据挖掘实验', '数据挖掘实验'],
            ['', '计算机网络', '', '数据挖掘技术', '', ''],
            ['', '', '', '', '', ''],
            ['', '', '', '', '', '']
        ],
        "4": [
            ['', '编译原理', '', '数据库原理及应用', '数据分析原理', ''],
            ['宪法学', '宪法学', '经济法', '经济法', '经济法', '','','习概','习概','',''],
            ['劳动教育', '劳动教育', '通用学术英语', '通用学术英语', '', '物权法','物权法','行政法','行政法','',''],
            ['', '', '', '', '数据挖掘实验', '数据挖掘实验'],
            ['', '计算机网络', '', '数据挖掘技术', '', ''],
            ['', '', '', '', '', ''],
            ['', '', '', '', '', '']
        ],
    }

# 模板 1：每日提醒模板
# 本周是开学的第: {{weeks.DATA}} 周
# 今天是: {{date.DATA}}
# 城市： {{city.DATA}}
# 天气： {{weather.DATA}}
# 最低气温: {{min_temperature.DATA}}
# 最高气温: {{max_temperature.DATA}}
# 今天是破壳日的第: {{love_day.DATA}} 天
# 距离开学还有: {{birthday.DATA}} 天
# ----------------今日课程----------------
# 第一讲: {{firstClass.DATA}}
# 第二讲: {{secondClass.DATA}}
# 第三讲: {{thirdClass.DATA}}
# 第四讲: {{fourthClass.DATA}}
# 第五讲: {{fifthClass.DATA}}
# 第六讲: {{sixthClass.DATA}}

# 模板 2 课程单推
# 课程信息: {{classInfo.DATA}}

# 模板 3 晚安心语推送和第二天课程推送
# {{goodNight.DATA}}
# ----------------明日课程----------------
# 明天是: {{week.DATA}}
# 第一讲: {{firstClass.DATA}}
# 第二讲: {{secondClass.DATA}}
# 第三讲: {{thirdClass.DATA}}
# 第四讲: {{fourthClass.DATA}}
# 第五讲: {{fifthClass.DATA}}
# 第六讲: {{sixthClass.DATA}}







